1. Create a DataFrame with the following data:

names = ['Alice', 'Bob', 'Charlie']

ages = [25, 30, 35]

cities = ['New York', 'Los Angeles', 'Chicago']

Use pd.DataFrame to construct it with column names Name, Age, and City.

In [1]:
import pandas as pd

In [2]:
data = {'names' : ['Harsha','Balu','Bods'],
        'ages' : [24,23,25],
        'cities' : ['Hyderabad', 'China', 'Japan']
       }
df1 = pd.DataFrame(data)
df1

    names  ages     cities
0  Harsha    24  Hyderabad
1    Balu    23      China
2    Bods    25      Japan

2. Create a DataFrame from a dictionary:

data = {'Product': ['A', 'B', 'C'], 'Price': [100, 200, 300]}

Add a new column called Discounted_Price which is 10% less than the original price.

In [3]:
data = {'Product': ['A', 'B', 'C'], 'Price': [100, 200, 300]}
df2 = pd.DataFrame(data)
df2['Discounted Price'] = df2['Price'] * 0.9
df2

  Product  Price  Discounted Price
0       A    100              90.0
1       B    200             180.0
2       C    300             270.0

3. Create a DataFrame using a list of lists and specify your own column names:

data = [[1, 'Apple'], [2, 'Banana'], [3, 'Cherry']]

Column names: ID, Fruit

In [4]:
data = [[1, 'Apple'], [2, 'Banana'], [3, 'Cherry']]
df3 = pd.DataFrame(data, columns = ['ID','Fruit'])
df3

   ID   Fruit
0   1   Apple
1   2  Banana
2   3  Cherry

4. Given the following two DataFrames:

df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]
})
Merge them on the ID column using inner join.

Try left, right, and outer joins and observe the difference.

In [5]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})
pd.merge(df1,df2, how='inner')

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90

In [6]:
pd.merge(df1,df2, how='outer')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
3   4      NaN   95.0

In [7]:
pd.merge(df1,df2, how='left')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0

In [8]:
pd.merge(df1,df2, how='right')

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90
2   4      NaN     95

5. Perform a merge where the key columns have different names:

df1 = pd.DataFrame({'emp_id': [1, 2, 3], 'Name': ['Tom', 'Jerry', 'Spike']})
df2 = pd.DataFrame({'id': [1, 2, 4], 'Department': ['HR', 'Finance', 'IT']})
Merge df1 and df2 where emp_id matches id.

In [9]:
df1 = pd.DataFrame({'emp_id': [1, 2, 3], 'Name': ['Tom', 'Jerry', 'Spike']})
df2 = pd.DataFrame({'id': [1, 2, 4], 'Department': ['HR', 'Finance', 'IT']})
pd.merge(df1,df2,left_on='emp_id',right_on='id',how='inner')

   emp_id   Name  id Department
0       1    Tom   1         HR
1       2  Jerry   2    Finance

6. Create two DataFrames with custom index:

df1 = pd.DataFrame({'Name': ['Alice', 'Bob']}, index=[1, 2])
df2 = pd.DataFrame({'Score': [90, 85]}, index=[2, 3])
Perform a join using .join() with how='inner' and how='outer'.

In [10]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob']}, index=[1, 2])
df2 = pd.DataFrame({'Score': [90, 85]}, index=[2, 3])
df1.join(df2,how='inner')

  Name  Score
2  Bob     90

In [11]:
df1.join(df2,how='outer')

    Name  Score
1  Alice    NaN
2    Bob   90.0
3    NaN   85.0

7. Create a scenario where you have a left DataFrame with customer data and a right DataFrame with their orders. Perform a join to show all customers and their orders (if any).

In [12]:
customers = pd.DataFrame({
    'customerid': [1, 2, 3, 4],
    'name': ['Harsha', 'Nithin', 'Chandu', 'Balu']
})

orders = pd.DataFrame({
    'orderid': [1011, 1022, 1033],
    'customerid': [11, 22, 32],
    'product': ['Pant', 'Shirt', 'Toys']
})

pd.merge(customers,orders,on='customerid',how='outer')

   customerid    name  orderid product
0           1  Harsha      NaN     NaN
1           2  Nithin      NaN     NaN
2           3  Chandu      NaN     NaN
3           4    Balu      NaN     NaN
4          11     NaN   1011.0    Pant
5          22     NaN   1022.0   Shirt
6          32     NaN   1033.0    Toys